{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"activity_regularizer": null, "kernel_size": [5, 5], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "data_format": "channels_last", "bias_regularizer": null, "dilation_rate": [1, 1], "use_bias": true, "bias_constraint": null, "activation": "relu", "strides": [1, 1], "batch_input_shape": [null, 28, 28, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "dtype": "float32", "name": "conv2d_1", "padding": "valid", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activation": "relu", "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dilation_rate": [1, 1], "use_bias": true, "trainable": true, "filters": 64, "kernel_regularizer": null, "activity_regularizer": null, "bias_regularizer": null, "name": "conv2d_2", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 1024, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"rate": 0.5, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "units": 10, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax", "trainable": true, "bias_regularizer": null, "use_bias": true, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null, "kernel_constraint": null}}], "backend": "tensorflow", "keras_version": "2.1.3"}