{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution2_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution2", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "32"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0], [2, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation5", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[3, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling2", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max"
      }, 
      "inputs": [[4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "convolution3_weight", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "convolution3_bias", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "64"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "convolution3", 
      "attrs": {
        "kernel": "(5, 5)", 
        "num_filter": "64"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation6", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[8, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "pooling3", 
      "attrs": {
        "kernel": "(2, 2)", 
        "pool_type": "max"
      }, 
      "inputs": [[9, 0, 0]]
    }, 
    {
      "op": "Flatten", 
      "name": "flatten2", 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected5_weight", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected5_bias", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected5", 
      "attrs": {"num_hidden": "1024"}, 
      "inputs": [[11, 0, 0], [12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "Activation", 
      "name": "activation7", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[14, 0, 0]]
    }, 
    {
      "op": "Dropout", 
      "name": "dropout0", 
      "attrs": {"p": "0.5"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fullyconnected6_weight", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fullyconnected6_bias", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fullyconnected6", 
      "attrs": {"num_hidden": "10"}, 
      "inputs": [[16, 0, 0], [17, 0, 0], [18, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "softmax_label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "softmax", 
      "inputs": [[19, 0, 0], [20, 0, 0]]
    }
  ], 
  "arg_nodes": [0, 1, 2, 6, 7, 12, 13, 17, 18, 20], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23
  ], 
  "heads": [[21, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10000]}
}