{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.3", "config": [{"class_name": "Dense", "config": {"units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true, "name": "dense_1", "batch_input_shape": [null, 4], "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"units": 3, "bias_regularizer": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_2", "use_bias": true, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}